{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<p>This blog was made with <a href=\"https://www.gatsbyjs.org/\">Gatsby.js</a> over all it has\nbeen a blast to make it and the fact that I could reuse my react skills maded me\nfeel like i am in controll.</p>\n<p>There were however a quite a lot of things that took some time to sink in. So I\nthough it might be nice for me to post about it.</p>\n<h3>Initial starter pack</h3>\n<p>So one of the tings I wish that I hade done differently is was to start out with\nthe hello world starter pack instead of the default one.</p>\n<p>There are a lot of nice things in the default started pack like SEO, Manifest and\nall of that goodness. But before actually understanding how gatsby works, this\ninitial stuff becomes rather confusing.</p>\n<p>Therefore I strongly recommend anyone who wants to learn <a href=\"https://www.gatsbyjs.org/\">Gatsby.js</a>\nto initialize a project with:</p>\n<pre><code class=\"language-bash\">gatsby new hello-world https://github.com/gatsbyjs/gatsby-starter-hello-world\n</code></pre>\n<h3>What it actually does</h3>\n<p>So gatsby is a static page generator. This took some time for me to realize, thinking\nit was more or less like writing any other React app. We need to sort of separate the\n<em>compile time</em> from <em>run time</em>. When <a href=\"https://www.gatsbyjs.org/\">Gatsby.js</a> compiles a\nproject it pulls in data from different sources. Examples of sources are:</p>\n<ul>\n<li><a href=\"https://www.gatsbyjs.org/packages/gatsby-source-filesystem/\">filesystem</a></li>\n<li><a href=\"https://www.gatsbyjs.org/packages/gatsby-source-custom-api/\">custom apis</a></li>\n<li><a href=\"https://www.gatsbyjs.org/packages/@mosch/gatsby-source-github/\">github</a></li>\n</ul>\n<p>There are many more of these <em>source</em> plugins. I would advice anyone to just start out\nwith the file system one. This is because it makes it is easier create a mental image\nof how <a href=\"https://www.gatsbyjs.org/\">Gatsby.js</a> works. It is easy to understand that these\nlocal files are managed at compile time and not at <em>run time</em>. The thing that I didn't\nreally understand at first was that even if the source was an API, <strong>the data was still\nfetched at <em>compile time</em></strong>.</p>\n<h3>GraphQL</h3>\n<p>So before making this blog I had never really worked with GraphQL on a \"<em>real</em>\" project.\nI had played around with <a href=\"https://github.com/graphql/graphiql\">GraphiQL</a> but that was about\nall I knew.</p>\n<p>So like I mentioned Gatsby pulls data from your <em>sources</em> at <em>compile time</em>. Once this is done\nIt exposes this data though GraphQL. I found that the easiest one to wrap my head around was\nonce again the <a href=\"https://www.gatsbyjs.org/packages/gatsby-source-filesystem/\">filesystem</a>.</p>","excerpt":"This blog was made with  Gatsby.js  over all it has\nbeen a blast to make it and the fact that I could reuse my react skills maded me\nfeel like i am in controll. There were however a quite a lot of…","frontmatter":{"title":"How I Made This Blog","path":"/posts/how-i-made-this-blog"}}}]}},"pageContext":{}}